home/.emacs.d/config.org
* Emacs Configs
Using /emacs-native-comp-git/ from AUR for improving performance
** Main config
*** Repositories
There is initializes package mangers and some other stuff \\
Package config -- see https://melpa.org/#/getting-started
#+begin_src emacs-lisp
(require 'package)
(add-to-list
 'package-archives
 ;; '("melpa" . "http://stable.melpa.org/packages/") ; many packages won't show if using stable
 '("melpa" . "https://melpa.org/packages/")
 t)
#+end_src
#+begin_src emacs-lisp
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
#+end_src

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp/")

(setq evil-want-keybinding nil)

;(setq evil-search-module 'evil-search)
#+end_src
** Packages
*** Auto completion
Use /company/ for autocompletion
#+begin_src emacs-lisp
(use-package company
  :ensure t
  :init
  (add-hook 'after-init-hook 'global-company-mode)
  :config
  (setq company-dabbrev-downcase nil)
  (setq company-idle-delay 0)
  (setq company-minimum-prefix-length 1)
  (setq company-tooltip-align-annotations t))
#+end_src
Lsp backend for /company/
#+begin_src emacs-lisp
(use-package company-lsp
  :ensure t
  :config
  (push 'company-lsp company-backends)
  (setq company-lsp-enable-snippet t)
  (setq lsp-enable-snippet t))
#+end_src
Pretty icons for /company/
#+begin_src emacs-lisp
(use-package company-box
  :ensure t
  :hook (company-mode . company-box-mode)
  :config
  (push '(company-yasnippet . (:all "lime green" :selected
    (:background "black"))) company-box-backends-colors))
#+end_src
Fuzzy match for /company/ \\
*Too slow btw*
#+begin_src emacs-lisp
  ;; (use-package company-fuzzy
  ;;   :ensure t
  ;;   :config
  ;;   (global-company-fuzzy-mode f))
#+end_src
Completion for commands
#+begin_src emacs-lisp
(use-package counsel
  :ensure t
  :init
  (ivy-mode 1))
#+end_src
Keys hints
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :config
  (which-key-mode 1))
#+end_src
*** Web
Package for html live view
#+begin_src emacs-lisp
(use-package impatient-mode
  :ensure t)
#+end_src
Cool web stuff
#+BEGIN_SRC emacs-lisp
(use-package web-mode
  :ensure t)
#+END_SRC

*** Projects
Projects management with /counsel/ completion
#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :config
  (projectile-mode))
(use-package counsel-projectile
  :ensure t)
#+end_src
Git tool
#+begin_src emacs-lisp
(use-package magit
  :ensure t)
#+end_src
Project tree
#+begin_src emacs-lisp
(use-package treemacs
  :ensure t)
(use-package treemacs-evil
  :ensure t)
(use-package treemacs-projectile
  :ensure t)
#+end_src
Start buffer
#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
#+end_src
Reveal.js for presentations
#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal
    :ensure t)
#+END_SRC

*** Evil mode
Evil with dependecies
#+begin_src emacs-lisp
(use-package undo-tree
  :ensure t)
(use-package goto-chg
  :ensure t)
(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1))
#+end_src
Collection of evil keybindings
#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))
#+end_src
Fast search
#+begin_src emacs-lisp
(use-package evil-snipe
  :ensure t
  :config
  (evil-snipe-mode +1)
  (evil-snipe-override-mode +1))
#+end_src
Change brakets in evil mode
#+begin_src emacs-lisp
(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))
#+end_src
Multicursor
#+begin_src emacs-lisp
(use-package evil-multiedit
  :ensure t)
(use-package evil-mc
  :ensure t
  :config
  (global-evil-mc-mode 1))
#+end_src
*** Visual
Icons
#+begin_src emacs-lisp
(use-package all-the-icons
 :ensure t)
#+end_src
HIghlight todo keywords
#+begin_src emacs-lisp
(use-package hl-todo
  :ensure t
  :config
  (global-hl-todo-mode t))
#+end_src
Colorize parenthesis
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
Org headers icons
#+begin_src emacs-lisp
(use-package org-bullets
  :ensure t)
#+end_src
*** Programming
Code::stats
#+BEGIN_SRC emacs-lisp
  (use-package code-stats
    :ensure t)
#+END_SRC

Auto parenthesis
#+begin_src emacs-lisp
(use-package smartparens
  :ensure t
  :init
  (smartparens-global-mode))
#+end_src
Editconfig support
#+begin_src emacs-lisp
(use-package editorconfig
  :ensure t
  :config
  (editorconfig-mode 1))
#+end_src
Snippets
#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :init
  (yas-global-mode 1))
(use-package yasnippet-snippets
  :ensure t)
#+end_src
Code formatting
#+begin_src emacs-lisp
(use-package format-all
  :ensure t)
#+end_src
Searching
#+begin_src emacs-lisp
(use-package avy
  :ensure t)
#+end_src
Windows hoping
#+begin_src emacs-lisp
(use-package ace-window
  :ensure t)
#+end_src
Dockerfile support
#+BEGIN_SRC emacs-lisp
  (use-package dockerfile-mode
    :ensure t)
#+END_SRC
**** Languages and lsp
lsp client
#+begin_src emacs-lisp
(use-package  lsp-mode
  :hook (
        (lsp-mode . lsp-enable-which-key-integration) 
        )
  :ensure t)
#+end_src
Add to hook =(XXX-mode . lsp)= for auto enabling lsp on /XXX-mode/ \\
Lsp integration with several plugins
#+begin_src emacs-lisp
(use-package flycheck
  :ensure t)
(use-package lsp-ui
  :ensure t)
(use-package lsp-treemacs
  :ensure t)
(use-package lsp-ivy
  :ensure t)
#+end_src
Python lsp
#+begin_src emacs-lisp
(use-package lsp-python-ms
  :ensure t
  :init (setq lsp-python-ms-auto-install-server t)
  :hook (python-mode . (lambda ()
                          (require 'lsp-python-ms))))
(use-package anaconda-mode
  :ensure t)
(use-package company-anaconda
  :ensure t)
#+end_src
Lsp for latex
#+begin_src emacs-lisp
(use-package lsp-latex
  :ensure t)
#+end_src
Go mode
#+begin_src emacs-lisp
(use-package go-mode
  :ensure t)
#+end_src
Haskell mode
#+begin_src emacs-lisp
(use-package haskell-mode
  :ensure t)
#+end_src
Yaml files
#+begin_src emacs-lisp
(use-package yaml-mode
  :ensure t)
#+end_src
Kotlin
#+BEGIN_SRC emacs-lisp
(use-package kotlin-mode
  :ensure t)
#+END_SRC
Graphviz
#+BEGIN_SRC emacs-lisp
(use-package graphviz-dot-mode
  :ensure t)
#+END_SRC
Ipython for org babel
#+BEGIN_SRC emacs-lisp
(use-package ob-ipython
  :ensure t)
#+END_SRC

*** Themes
/Doom-modeline/ as modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init 
  (doom-modeline-mode 1)
  :config
  (setq doom-modeline-icon t))
#+end_src
Colors from pywal
#+begin_src emacs-lisp
(use-package ewal
  :ensure t
  :init (setq ewal-use-built-in-always nil
              ewal-use-built-in-on-failure-p t
              ewal-built-in-palette "doom-gruvbox"))
(use-package ewal-doom-themes
  :ensure t)
  ;; :init (load-theme 'ewal-doom-one t))
#+end_src
*Or* Colors from xresources
#+begin_src emacs-lisp
  ;; (use-package xresources-theme
  ;;   :ensure t)
#+end_src
*Or* doom theme
#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :preface (defvar region-fg nil)
    (setq doom-themes-treemacs-theme "doom-colors")
    (doom-themes-treemacs-config)
    (doom-themes-org-config)
    :init (load-theme 'doom-monokai-classic t))
#+end_src
*** Keybingings
Convenient keybindings
#+begin_src emacs-lisp
(use-package general
  :ensure t)
#+end_src
Cinstructing menus
#+begin_src emacs-lisp
(use-package hydra
  :ensure t)
#+end_src
** TODO Variables and functions
*** Snippets
Add snippets to company backends
*For some reason doesn't execute on start*
#+begin_src emacs-lisp
(setq company-backends 
  '(company-capf 
    company-bbdb 
    company-clang 
    company-keywords 
    company-yasnippet 
    company-lsp 
    company-files 
    company-anaconda))

(defun mars/company-backend-with-yas (backends)
  "Add :with company-yasnippet to company BACKENDS.
Taken from https://github.com/syl20bnr/spacemacs/pull/179."
  (if (and (listp backends) (memq 'company-yasnippet backends))
    backends
    (append (if (consp backends)
              backends
              (list backends))
      '(:with company-yasnippet))))

(defun add-yas-in-company ()
  (setq company-backends
    (mapcar #'mars/company-backend-with-yas company-backends)))

(add-yas-in-company)
#+end_src
