home/.emacs.d/config.org
*** Functions
Compilation window behaviour
#+begin_src emacs-lisp
(defun kill-buffer-if-exists (buffer)
  (when (not (eq nil (get-buffer buffer)))
     (delete-windows-on buffer) (kill-buffer buffer)))

(defun kill-compilation-buffer ()
  (interactive)
  (kill-buffer-if-exists "*compilation*"))
  

(defun my-compile ()
      "Run compile and resize the compile window"
      (interactive)
      (progn
        (call-interactively 'compile)
        (setq cur (selected-window))
        (setq w (get-buffer-window "*compilation*"))
        (select-window w)
        (setq h (window-height w))
        ;; (shrink-window (- h 20))
        (select-window cur)))

(defun my-compilation-hook () 
    "Make sure that the compile window is splitting vertically"
    (progn
      (if (not (get-buffer-window "*compilation*"))
         (progn
	    (split-window-vertically)))))

;; (add-hook 'compilation-mode-hook 'my-compilation-hook)
;; (remove-hook 'compilation-mode-hook 'my-compilation-hook t)

#+end_src
*** Other variables
Code::stats
#+BEGIN_SRC emacs-lisp
  (load "~/.emacs.d/private.el")
  (add-hook 'prog-mode-hook #'code-stats-mode)
  (add-hook 'org-mode-hook #'code-stats-mode)
  (run-with-idle-timer 30 t #'code-stats-sync)
  (add-hook 'kill-emacs-hook (lambda () (code-stats-sync :wait)))  
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq compilation-scroll-output 'first-error)
#+END_SRC
Executable path
#+BEGIN_SRC  emacs-lisp
  (add-to-list 'exec-path "~/.local/bin")
#+END_SRC

*** TODO Other
#+begin_src emacs-lisp
(defun init-hooks () (global-display-line-numbers-mode 1))

(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
(setq dashboard-center-content t)
(setq dashboard-startup-banner "~/Themes/Neofetch.png")
(setq dashboard-set-heading-icons t)
(setq dashboard-set-file-icons t)

(setq dashboard-items '((recents  . 5)
                        ;(bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)
                        (registers . 5)))

(add-hook 'after-init-hook 'init-hooks)

(add-hook 'shell-mode-hook (lambda () (company-mode nil)))

(scroll-bar-mode 0) ; no scroll bar
(tool-bar-mode 0) ; no tool bar
(menu-bar-mode 0) ; no menu bar
(show-paren-mode 1) ; visualize matching parenthesees
(global-hl-line-mode 1) ; highlight current line
(eldoc-mode 1) ; enable docs in minibuffer
;; (setq inhibit-startup-screen 1) ; no start screen

(setq ivy-use-selectable-prompt t)

;; store all backups in a single directory 
(setq backup-directory-alist
      `(("." . ,(concat user-emacs-directory "backups"))))

;; y or n instead of yes-or no
(fset 'yes-or-no-p 'y-or-n-p)

;; no annoying bell!
(setq ring-bell-function 'ignore)

;; set font
(set-face-attribute 'default nil
                    :family "Fira Code"
                    :height 85)

(setq company-math-allow-latex-symbols-in-faces t)

;; isearch
(define-key isearch-mode-map (kbd "<down>") 'isearch-ring-advance)
(define-key isearch-mode-map (kbd "<up>") 'isearch-ring-retreat)
(setq case-fold-search t)

(setq projectile-completion-system 'ivy)

(setq ivy-initial-inputs-alist nil)

(setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))

;; set my init filt to be this file
(setq user-init-file "~/.emacs.d/init.el")

;; Evil initial states
(cl-loop for (mode . state) in '( (dired-mode . emacs)
                             )
      do (evil-set-initial-state mode state))

;; Highlight TODO colors
(setq hl-todo-keyword-faces
      '(("TODO"   . "#fabd2f")
        ("FIXME"  . "#fb4934")))
#+end_src
** Keybindings
Disabling arrow keys for *nothing?*
#+BEGIN_SRC emacs-lisp
  ;; (define-minor-mode my-override-mode
  ;;   "Overrides all major and minor mode keys" t)

  ;; (defvar my-override-map (make-sparse-keymap "my-override-map")
  ;;   "Override all major and minor mode keys")

  ;; (add-to-list 'emulation-mode-map-alists
  ;;   `((my-override-mode . ,my-override-map)))

  ;; (define-key my-override-map (kbd "<left>")
  ;;   (lambda ()
  ;;     (interactive)
  ;;     (message "Use Vim keys: h for Left")))

  ;; (define-key my-override-map (kbd "<right>")
  ;;   (lambda ()
  ;;     (interactive)
  ;;     (message "Use Vim keys: l for Right")))

  ;; (define-key my-override-map (kbd "<up>")
  ;;   (lambda ()
  ;;     (interactive)
  ;;     (message "Use Vim keys: k for Up")))

  ;; (define-key my-override-map (kbd "<down>")
  ;;   (lambda ()
  ;;     (interactive)
  ;;     (message "Use Vim keys: j for Down")))
  ;; (evil-make-intercept-map my-override-map)
#+END_SRC


#+begin_src emacs-lisp

(general-define-key
  :keymaps 'company-active-map
  "<tab>"     'yas-expand
  "<backtab>" 'company-complete-selection)

(general-define-key
  "M-x" 'counsel-M-x)
#+end_src

Bindings using /general/ package
#+begin_src emacs-lisp
  (general-define-key
    :states '(normal visual emacs insert treemacs)
    :prefix "SPC"
    :non-normal-prefix "M-SPC"
    :keymaps 'override
    "bb" 'ibuffer
    "cd" 'kill-compilation-buffer
    "cc" 'compile
    "cr" 'lsp-rename
    "ca" 'lsp-execute-code-action
    "sl" 'lsp
    "ss" 'lsp-workspace-shutdown
    "sr" 'lsp-workspace-restart
    "wk" 'kill-buffer-and-window
    "wd" 'delete-window
    "ww" 'ace-window
    "gs" 'avy-goto-char-timer
    "gl" 'avy-goto-line
    "gr" 'revert-buffer
    "wr" 'hydra-window-resize-menu/body
    "pp" 'projectile-switch-project
    "pf" 'counsel-projectile-find-file
    "pc" 'projectile-compile-project
    "ff" 'counsel-find-file
    "cl" 'comment-or-uncomment-region
    "cf" 'counsel-grep-or-swiper
    "op" 'treemacs
    "om" 'magit
    "tt" 'treemacs-select-window)

  (general-define-key
    :states '(visual)
    :keymaps 'override
    "R"  'evil-multiedit-match-all
    )

  (general-define-key
    :states '(normal visual insert)
    :prefix "SPC"
    :non-normal-prefix "M-SPC"
    :keymaps 'latex-mode-map
    "si" 'latex-insert-block
    )
#+end_src

Hydra
#+begin_src emacs-lisp
(defhydra hydra-window-resize-menu (:color red
                                    :hint nil)
  "
  Window Resize
  -------------
       /\\
        _k_
  < _h_     _l_ >
        _j_
        v
  "
  ("h" evil-window-decrease-width)
  ("l" evil-window-increase-width)
  ("k" evil-window-decrease-height)
  ("j" evil-window-increase-height)
  ("c" nil "Cancel"))
#+end_src
